app/views/todos/index.html.erb

        <td><%= link_to todo.name, todo_path(todo) %></td>
        <td><%= todo&.tasks.count %></td>
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."todo_id" = $1  [["todo_id", 2]]