app/views/todos/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."todo_id" = $1  [["todo_id", 1]]
---
  <%= @todo.name %>
  <% @todo.tasks.each do |task| %>