app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "todo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "React Native"], ["todo_id", 2], ["created_at", "2022-02-03 19:56:46.511876"], ["updated_at", "2022-02-03 19:56:46.511876"]]
---
  def create
    @task = Task.new(task_params)
    if @task.save

UPDATE "tasks" SET "title" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["title", "Curso de React na Alura"], ["updated_at", "2022-02-03 19:32:50.305077"], ["id", 2]]
---
  def update
    if @task.update(task_params)