app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)

    if @todo.save
---
INSERT INTO "todos" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Estudar"], ["created_at", "2022-02-03 19:56:37.673399"], ["updated_at", "2022-02-03 19:56:37.673399"]]

  def update
    if @todo.update(todo_params)
---
UPDATE "todos" SET "name" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["name", "Atividade Física"], ["updated_at", "2022-02-03 20:33:16.184822"], ["id", 3]]