app/models/todo.rb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."todo_id" = $1 AND "tasks"."done" = $2  [["todo_id", 2], ["done", true]]
---
  def tasks_completed
    self&.tasks.where(done: true).count

SELECT "tasks"."done" FROM "tasks" WHERE "tasks"."todo_id" = $1  [["todo_id", 2]]
---
  def completed?
    self&.tasks.pluck(:done).uniq.size > 1 ? false : true